src/main/resources/postman.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:gs="http://www.geekbrains.com/geekspring/wsdproducts/generation">

	<soapenv:Header/>
	<soapenv:Body>
		<gs:getProductsRequest>
			<gs:id>1</gs:id>
		</gs:getProductsRequest>
	</soapenv:Body>

</soapenv:Envelope>

GET

localhost:8189/project/ws/products.wsdl

$2a$10$CGamJWPYokRss2FX6WcBJOgFIDKyUoCYnrGtepfVQyDSTdngSxrzK